{
  "about": "About Me",
  "back_home": "← Back to Home",

  "objective": "Objective",
  "objective_text": "Work as a Front-End Developer.",

  "resume": "Professional Summary",
  "resume_text": "Currently in training in Web Development, with solid knowledge in HTML, CSS and JavaScript. I have already completed fundamental front-end modules, including programming logic, API consumption with Fetch and DOM manipulation. I have knowledge in Automated Testing with Jest and development with React, including the use of Context API. I also have experience with TailwindCSS and TypeScript, expanding my skills to build modern, scalable and well-structured applications. I am a dedicated, proactive and creative person, with ease to work in a team and solve problems. I am looking for my first opportunity as a junior front-end developer to apply my knowledge, collaborate on real projects and continue to grow technically and professionally.",

  "education": "Education",
  "courses": "Courses and Certifications",
  "languages": "Languages",

  "education_items": [
    "Centro de Ensino Educare - High School - Jan/2018 - Dec/2019"
  ],
  "courses_items": [
    "Dev Quest - Dev em Dobro - Front-End Web Development - Apr/2025 - ongoing",
    "Sebrae - Learning to Undertake - Feb/2019"
  ],
  "languages_items": ["Advanced English", "Native Portuguese"],

  "tech_skills": "Technical Skills",
  "tech_skills_items": [
    "HTML5",
    "CSS3",
    "JavaScript (ES6+)",
    "DOM Manipulation",
    "API Consumption (Fetch)",
    "Git and GitHub",
    "React.js + Vite",
    "TypeScript",
    "TailwindCSS",
    "Context API"
  ],

  "soft_skills": "Soft Skills",
  "soft_skills_items": [
    "Teamwork",
    "Communication",
    "Proactivity",
    "Organization",
    "Creativity"
  ],

  "projects": "Projects",
  "github": "GitHub",
  "vercel": "Vercel",

  "project_descriptions": {
    "mini_ats": "A mini system for managing job applications, built with React + TypeScript, allowing you to add, edit, remove and filter jobs.",
    "admin_dashboard": "A modern and responsive admin panel built with React + Vite, TypeScript and Tailwind CSS. Includes user management, saved browser settings and metrics visualization.",
    "analisador_gemini": "This project is a code analyzer powered by Google Gemini API. Built with React + Vite.",
    "search_github": "Search the GitHub API for a user and return their information such as name, bio, profile image and repositories.",
    "pokemon_explorer": "React+Vite application to list and explore Pokémon using the PokéAPI.",
    "doce_encanto": "A modern and responsive website for the fictional bakery Doce Encanto, developed with React + Vite, focused on user experience and attractive design."
  },

  "contact_title": "Get in Touch",
  "contact_qr_text": "Scan the QR Code to access my LinkedIn",
  "contact_whatsapp": "WhatsApp",
  "contact_email": "Email",

  "contact": "Contact"
}
