{
  "about": "About Me",
  "back_home": "← Back to Home",

  "objective": "Objective",
  "objective_text": "Seeking a position as a Junior Front-End Developer.",

  "resume": "Professional Summary",
  "resume_text": "Currently in training in Web Development with solid knowledge in HTML, CSS and JavaScript. Completed the Front-End module, covering programming logic, API consumption with Fetch, and DOM manipulation. Skilled in React.js (including Context API), TypeScript, and Tailwind CSS, as well as knowledge in Automated Testing with Jest. I am currently expanding my studies with the Back-End module, aiming to gain a broader understanding of the full development cycle. I am a dedicated, proactive, and creative professional with strong teamwork and problem-solving skills. Seeking my first opportunity as a Junior Front-End Developer to apply my knowledge, contribute to real projects, and continue growing both technically and professionally.",

  "education": "Education",
  "courses": "Courses and Certifications",
  "languages": "Languages",

  "education_items": [
    "Centro de Ensino Educare - High School (Jan/2018 – Dec/2019)"
  ],
  "courses_items": [
    "Dev Quest - Dev em Dobro - Front-End Web Development (Apr/2025 – Completed)",
    "Sebrae - Entrepreneurship Basics (Feb/2019)"
  ],
  "languages_items": ["Advanced English", "Native Portuguese"],

  "tech_skills": "Technical Skills",
  "tech_skills_items": [
    "HTML5",
    "CSS3",
    "JavaScript (ES6+)",
    "DOM Manipulation",
    "API Consumption (Fetch)",
    "Git and GitHub",
    "React.js + Vite",
    "TypeScript",
    "Tailwind CSS",
    "Context API"
  ],

  "soft_skills": "Soft Skills",
  "soft_skills_items": [
    "Teamwork",
    "Communication",
    "Proactivity",
    "Organization",
    "Creativity"
  ],

  "projects": "Projects",
  "github": "GitHub",
  "vercel": "Vercel",

  "project_descriptions": {
    "mini_ats": "A mini system for managing job applications, built with React + TypeScript, allowing you to add, edit, remove and filter jobs.",
    "admin_dashboard": "A modern and responsive admin panel built with React + Vite, TypeScript and Tailwind CSS. Includes user management, saved browser settings and metrics visualization.",
    "analisador_gemini": "This project is a code analyzer powered by Google Gemini API. Built with React + Vite.",
    "search_github": "Search the GitHub API for a user and return their information such as name, bio, profile image and repositories.",
    "pokemon_explorer": "React+Vite application to list and explore Pokémon using the PokéAPI.",
    "doce_encanto": "A modern and responsive website for the fictional bakery Doce Encanto, developed with React + Vite, focused on user experience and attractive design."
  },

  "contact_title": "Get in Touch",
  "contact_qr_text": "Scan the QR Code to access my LinkedIn",
  "contact_whatsapp": "WhatsApp",
  "contact_email": "Email",

  "contact": "Contact"
}
